# Creating Series

In [1]:
# Program for creating Series using series() method of Pandas Library

In [25]:
#Import Pandas library
import pandas as pd

In [26]:
#Creating Student Name List
Name=["Aagaz","sanjari","zoro","luffy","naruto"]
Name

['Aagaz', 'sanjari', 'zoro', 'luffy', 'naruto']

In [27]:
#Creating a Series 
Roll_list=pd.Series(Name,index=[1,2,3,4,5])
print(Roll_list)

1      Aagaz
,2    sanjari
,3       zoro
,4      luffy
,5     naruto
,dtype: object

# Creating Data Frame

In [28]:

#Import Pandas library
import pandas as pd

In [29]:
#Creating Data Frame
df=pd.DataFrame([[10,12,14,16],[11,18,15,21],[12,13,14,15]],
columns= ["BI","DBMS","DSS","CAO"])

In [30]:
df

   BI  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15

In [31]:
df.shape

(3, 4)

In [32]:
df.size

12

In [33]:
df.ndim

2

# Adding Record (Row) to the data frame

In [34]:
import pandas as pd

In [35]:
df2=pd.DataFrame([[5,6,7,8]],
columns= ["BI","DBMS","DSS","CAO"])

In [36]:
df3 = pd.concat([df, df2], ignore_index=True)

In [37]:
df3

   BI  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3   5     6    7    8

# Adding Attribute (Columns) name DM

In [15]:
df3["DM"]=[12,15,16,14]

In [16]:
df3

   BI  DBMS  DSS  CAO  DM
0  10    12   14   16  12
1  11    18   15   21  15
2  12    13   14   15  16
3   5     6    7    8  14

# Deleting Record from  df3 dataframe

In [17]:
df4=df3.drop(index=[1])

In [18]:
df4

   BI  DBMS  DSS  CAO  DM
0  10    12   14   16  12
2  12    13   14   15  16
3   5     6    7    8  14

# Deleting Attribute (Columns) from df3 dataframe

In [19]:
df5=df3.drop(columns=["DM"])

In [20]:
df5

   BI  DBMS  DSS  CAO
0  10    12   14   16
1  11    18   15   21
2  12    13   14   15
3   5     6    7    8

In [21]:
#Finding mean of DSS 

print("Mean of DSS:", df5["DSS"].mean())

Mean of DSS: 12.5

In [22]:
#Finding median of DSS

print("Median of DSS:", df5["DSS"].median())

Median of DSS: 14.0

In [23]:
#Finding mode of DSS

print("Mode of DSS:", df5["DSS"].mode())

Mode of DSS: 0    14
,Name: DSS, dtype: int64

In [24]:
#Finding max number of DSS

print("Max of DSS:", df5["DSS"].max())

Max of DSS: 15

In [30]:
#Finding Min number of DSS

print("Max of DSS:", df5["DSS"].min())

Max of DSS: 7